app/controllers/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."title" = '36' LIMIT 1
---
  def delete
    place_to_be_deleted = Place.find_by(:title => params["id"])