app/controllers/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."title" = 'Chicago Children''s Museum' LIMIT 1
---
  def show
    @place = Place.find_by(:title => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 107 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 36
---
  def delete
    place_to_be_deleted = Place.find_by(:id => params["id"])
    place_to_be_deleted.delete

INSERT INTO "places" ("admission_price", "description", "photo_url", "title") VALUES (?, ?, ?, ?)  [["admission_price", 0], ["description", "dfsa"], ["photo_url", "ds"], ["title", "ffs"]]
---
  def create
    title = params["title"]
    url = params["photo_url"]
    price = params["admission_price"]
    description = params["description"]
    Place.create(title: title, photo_url: url, admission_price: price, description: description)

SELECT  "places".* FROM "places"  WHERE "places"."title" = '79' LIMIT 1
---
  def edit
    @place_to_be_edited = Place.find_by(:title => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."title" = '118' LIMIT 1
UPDATE "places" SET "description" = ? WHERE "places"."id" = 119  [["description", "Shedd Aquarium (formally the John G. Shedd Aquarium) is an indoor public aquarium in Chicago, Illinois in the United States that opened on."]]
---
  def update
    update_place = Place.find_by(:title => params["id"])
    update_place.title = params["title"]
    update_place.photo_url = params["url"]
    update_place.admission_price = params["price"]
    update_place.description = params["description"]
    update_place.save